--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\IRAKW01\Wozniak PC porting Dropbox\Abigail Wozniak (abigailwozniak)\Abigail Woznia
> kâ€™s files\Home\JHR Revision\acs_moves_marriage.log
  log type:  text
 opened on:  17 Mar 2021, 10:03:48

. 
. /*** Look at prevalence of new marriage among movers in ACS ***/
. 
. qui do usa_00027.do

. 
. keep if gq==1 | gq==2
(611,158 observations deleted)

. drop if qmarinyr==4
(75,703 observations deleted)

. drop if qmigrat1==4
(236,041 observations deleted)

. drop if qmarst==4
(39,527 observations deleted)

. 
. replace perwt=round(perwt/100)
(3,644,262 real changes made)

. 
. * Sample already limited to ages 18-28
. 
. tab1 marrinyr

-> tabulation of marrinyr  

    Married |
 within the |
  past year |      Freq.     Percent        Cum.
------------+-----------------------------------
        N/A |  2,855,895       78.37       78.37
 Blank (No) |    634,458       17.41       95.78
        Yes |    153,909        4.22      100.00
------------+-----------------------------------
      Total |  3,644,262      100.00

. recode marrinyr (0=.) (1=0) (2=1)
(marrinyr: 3644262 changes made)

. recode divinyr (0 8=.) (1=0) (2=1)
(divinyr: 3644262 changes made)

. 
. gen married=.
(3,644,262 missing values generated)

. tab1 marst

-> tabulation of marst  

         Marital status |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Married, spouse present |    653,978       17.95       17.95
 Married, spouse absent |     43,691        1.20       19.14
              Separated |     31,203        0.86       20.00
               Divorced |     56,808        1.56       21.56
                Widowed |      2,687        0.07       21.63
   Never married/single |  2,855,895       78.37      100.00
------------------------+-----------------------------------
                  Total |  3,644,262      100.00

. replace married=1 if marst==1 | marst==2
(697,669 real changes made)

. replace married=0 if inlist(marst,3,4,5,6)==1
(2,946,593 real changes made)

. 
. * Moved is moved house or higher, movedst is moved states or higher. No county-level, within state mov
> e category in migrate1.
. 
. gen moved=.
(3,644,262 missing values generated)

. replace moved=0 if migrate1==1
(2,671,086 real changes made)

. replace moved=1 if migrate1==2 | migrate1==3 | migrate1==4
(973,176 real changes made)

. gen movedst=.
(3,644,262 missing values generated)

. replace movedst=0 if migrate1==1 | migrate1==2
(3,449,654 real changes made)

. replace movedst=1 if migrate1==3 | migrate1==4
(194,608 real changes made)

. 
. summ marrinyr divinyr married moved movedst

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    marrinyr |    788,367    .1952251    .3963741          0          1
     divinyr |    788,318    .0259261    .1589149          0          1
     married |  3,644,262    .1914432    .3934371          0          1
       moved |  3,644,262    .2670434    .4424153          0          1
     movedst |  3,644,262    .0534012    .2248322          0          1

. 
. reg marrinyr moved [pw=perwt], robust
(sum of wgt is 901,617)

Linear regression                               Number of obs     =    628,444
                                                F(1, 628442)      =   10688.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0263
                                                Root MSE          =     .38722

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1352093   .0013078   103.39   0.000     .1326461    .1377725
       _cons |   .1454655   .0006274   231.86   0.000     .1442359    .1466952
------------------------------------------------------------------------------

.   estimates store A

. reg marrinyr moved if sex==1 [pw=perwt], robust
(sum of wgt is 351,060)

Linear regression                               Number of obs     =    242,219
                                                F(1, 242217)      =    4410.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0277
                                                Root MSE          =     .39851

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1415616   .0021315    66.41   0.000      .137384    .1457393
       _cons |   .1570206   .0010559   148.71   0.000     .1549511    .1590901
------------------------------------------------------------------------------

.   estimates store Amen

. reg marrinyr moved if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 213,688)

Linear regression                               Number of obs     =    143,220
                                                F(1, 143218)      =    2455.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0268
                                                Root MSE          =      .3929

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1380464   .0027857    49.55   0.000     .1325864    .1435064
       _cons |   .1512447   .0013541   111.70   0.000     .1485908    .1538987
------------------------------------------------------------------------------

.   estimates store Aed

. reg marrinyr moved if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robust
(sum of wgt is 166,317)

Linear regression                               Number of obs     =    114,357
                                                F(1, 114355)      =    2238.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0307
                                                Root MSE          =      .3917

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1475811   .0031196    47.31   0.000     .1414668    .1536955
       _cons |   .1477021   .0014971    98.66   0.000     .1447678    .1506364
------------------------------------------------------------------------------

.   estimates store Awhite

. reg marrinyr moved if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robust
(sum of wgt is 19,783)

Linear regression                               Number of obs     =     10,988
                                                F(1, 10986)       =     146.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0204
                                                Root MSE          =     .39829

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1194003   .0098782    12.09   0.000     .1000372    .1387633
       _cons |   .1595923   .0051027    31.28   0.000       .14959    .1695945
------------------------------------------------------------------------------

.   estimates store Ablack

. reg marrinyr moved if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1 [pw=perwt], ro
> bust
(sum of wgt is 47,753)

Linear regression                               Number of obs     =     29,756
                                                F(1, 29754)       =     372.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0197
                                                Root MSE          =     .37361

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       moved |   .1142098   .0059193    19.29   0.000     .1026076     .125812
       _cons |   .1362085   .0027709    49.16   0.000     .1307773    .1416396
------------------------------------------------------------------------------

.   estimates store Ahisp

.   
. reg marrinyr movedst [pw=perwt], robust
(sum of wgt is 901,617)

Linear regression                               Number of obs     =    628,444
                                                F(1, 628442)      =    1740.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .39145

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .1054607    .002528    41.72   0.000      .100506    .1104154
       _cons |   .1824291   .0005849   311.92   0.000     .1812828    .1835754
------------------------------------------------------------------------------

.   estimates store B

. reg marrinyr movedst if sex==1 [pw=perwt], robust
(sum of wgt is 351,060)

Linear regression                               Number of obs     =    242,219
                                                F(1, 242217)      =     438.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0030
                                                Root MSE          =     .40352

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0846273   .0040404    20.95   0.000     .0767082    .0925464
       _cons |   .1992567   .0009775   203.85   0.000     .1973408    .2011725
------------------------------------------------------------------------------

.   estimates store Bmen

. reg marrinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 213,688)

Linear regression                               Number of obs     =    143,220
                                                F(1, 143218)      =     209.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0026
                                                Root MSE          =     .39776

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0791352   .0054613    14.49   0.000     .0684312    .0898392
       _cons |   .1921563   .0012597   152.54   0.000     .1896873    .1946253
------------------------------------------------------------------------------

.   estimates store Bed

. reg marrinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robust
(sum of wgt is 166,317)

Linear regression                               Number of obs     =    114,357
                                                F(1, 114355)      =     179.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0028
                                                Root MSE          =     .39729

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0828401   .0061807    13.40   0.000     .0707259    .0949542
       _cons |   .1913912   .0014025   136.46   0.000     .1886422    .1941402
------------------------------------------------------------------------------

.   est sto Bwhite

. reg marrinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robust
(sum of wgt is 19,783)

Linear regression                               Number of obs     =     10,988
                                                F(1, 10986)       =      16.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0027
                                                Root MSE          =     .40188

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0775676   .0188953     4.11   0.000     .0405294    .1146058
       _cons |   .1970803   .0046522    42.36   0.000     .1879612    .2061994
------------------------------------------------------------------------------

.   est sto Bblack

. reg marrinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1 [pw=perwt], 
> robust
(sum of wgt is 47,753)

Linear regression                               Number of obs     =     29,756
                                                F(1, 29754)       =      27.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0015
                                                Root MSE          =     .37707

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0632401   .0119773     5.28   0.000      .039764    .0867162
       _cons |    .168426   .0025949    64.91   0.000     .1633398    .1735121
------------------------------------------------------------------------------

.   est sto Bhisp

.   
. reg divinyr movedst [pw=perwt], robust
(sum of wgt is 901,574)

Linear regression                               Number of obs     =    628,408
                                                F(1, 628406)      =      13.82
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0000
                                                Root MSE          =     .16593

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0037973   .0010216     3.72   0.000     .0017951    .0057996
       _cons |   .0280595   .0002646   106.05   0.000     .0275409    .0285781
------------------------------------------------------------------------------

.   est sto C

. reg divinyr movedst if sex==1 [pw=perwt], robust
(sum of wgt is 351,046)

Linear regression                               Number of obs     =    242,207
                                                F(1, 242205)      =      18.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0001
                                                Root MSE          =     .16459

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0073584   .0016898     4.35   0.000     .0040463    .0106704
       _cons |   .0273197   .0004264    64.08   0.000     .0264841    .0281554
------------------------------------------------------------------------------

.   est sto Cmen

. reg divinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 213,679)

Linear regression                               Number of obs     =    143,213
                                                F(1, 143211)      =      32.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0005
                                                Root MSE          =     .17987

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0150941   .0026334     5.73   0.000     .0099327    .0202556
       _cons |   .0324297   .0005978    54.25   0.000     .0312581    .0336013
------------------------------------------------------------------------------

.   est sto Ced

. reg divinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robust
(sum of wgt is 166,309)

Linear regression                               Number of obs     =    114,351
                                                F(1, 114349)      =      36.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0007
                                                Root MSE          =     .18152

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0187144   .0030794     6.08   0.000     .0126788      .02475
       _cons |   .0328365   .0006752    48.63   0.000     .0315131    .0341599
------------------------------------------------------------------------------

.   est sto Cwhite

. reg divinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robust
(sum of wgt is 19,783)

Linear regression                               Number of obs     =     10,988
                                                F(1, 10986)       =       1.57
                                                Prob > F          =     0.2104
                                                R-squared         =     0.0003
                                                Root MSE          =     .18372

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |    .011373   .0090801     1.25   0.210    -.0064257    .0291717
       _cons |   .0340816    .002171    15.70   0.000     .0298259    .0383372
------------------------------------------------------------------------------

.   est sto Cblack

. reg divinyr movedst if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1 [pw=perwt], r
> obust
(sum of wgt is 47,752)

Linear regression                               Number of obs     =     29,755
                                                F(1, 29753)       =       0.97
                                                Prob > F          =     0.3247
                                                R-squared         =     0.0000
                                                Root MSE          =     .15505

------------------------------------------------------------------------------
             |               Robust
     divinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0045642   .0046341     0.98   0.325    -.0045189    .0136473
       _cons |    .024394   .0010922    22.34   0.000     .0222533    .0265347
------------------------------------------------------------------------------

.   est sto Chisp

.   
. reg married movedst [pw=perwt], robust
(sum of wgt is 4,613,465)

Linear regression                               Number of obs     =  3,060,130
                                                F(1, 3060128)     =    3426.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0019
                                                Root MSE          =     .37479

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0729168   .0012457    58.54   0.000     .0704753    .0753583
       _cons |   .1655771   .0002479   667.99   0.000     .1650913     .166063
------------------------------------------------------------------------------

.   est sto D

. reg married movedst if sex==1 [pw=perwt], robust
(sum of wgt is 2,313,096)

Linear regression                               Number of obs     =  1,516,686
                                                F(1, 1516684)     =    1427.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0017
                                                Root MSE          =     .34003

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0625515   .0016557    37.78   0.000     .0593064    .0657966
       _cons |   .1304232   .0003192   408.55   0.000     .1297975    .1310489
------------------------------------------------------------------------------

.   est sto Dmen

. reg married movedst if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 1,498,213)

Linear regression                               Number of obs     =    965,495
                                                F(1, 965493)      =    1253.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0027
                                                Root MSE          =     .32811

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0855936    .002418    35.40   0.000     .0808544    .0903328
       _cons |   .1195309   .0003865   309.27   0.000     .1187734    .1202884
------------------------------------------------------------------------------

.   est sto Ded

. reg married movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robust
(sum of wgt is 1,056,545)

Linear regression                               Number of obs     =    703,434
                                                F(1, 703432)      =     877.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0025
                                                Root MSE          =     .34247

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0846886   .0028593    29.62   0.000     .0790845    .0902928
       _cons |   .1324861   .0004733   279.94   0.000     .1315585    .1334137
------------------------------------------------------------------------------

.   est sto Dwhite

. reg married movedst if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robust
(sum of wgt is 213,420)

Linear regression                               Number of obs     =    115,235
                                                F(1, 115233)      =     188.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0047
                                                Root MSE          =     .26614

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0979477   .0071436    13.71   0.000     .0839463    .1119491
       _cons |   .0735852   .0009142    80.49   0.000     .0717933    .0753771
------------------------------------------------------------------------------

.   est sto Dblack

. reg married movedst if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1 [pw=perwt], r
> obust
(sum of wgt is 319,988)

Linear regression                               Number of obs     =    196,302
                                                F(1, 196300)      =     259.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0028
                                                Root MSE          =     .33717

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .1022683   .0063512    16.10   0.000     .0898202    .1147164
       _cons |   .1279787   .0008852   144.58   0.000     .1262437    .1297137
------------------------------------------------------------------------------

.   est sto Dhisp

. 
. gen scplus=.
(3,644,262 missing values generated)

. replace scplus=1 if educd >=65 & educd < 999
(2,171,438 real changes made)

. replace scplus=0 if educd < 65 & educd > 1
(1,472,824 real changes made)

. tab1 scplus

-> tabulation of scplus  

     scplus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,472,824       40.41       40.41
          1 |  2,171,438       59.59      100.00
------------+-----------------------------------
      Total |  3,644,262      100.00

. 
. reg marrinyr movedst scplus i.age [pw=perwt], robust
(sum of wgt is 901,617)

Linear regression                               Number of obs     =    628,444
                                                F(12, 628431)     =    1856.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0550
                                                Root MSE          =     .38147

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0799004   .0024435    32.70   0.000     .0751112    .0846896
      scplus |   .0836722   .0011343    73.77   0.000      .081449    .0858954
             |
         age |
         19  |   .0058102   .0124334     0.47   0.640    -.0185589    .0301793
         20  |  -.0970431   .0112788    -8.60   0.000    -.1191492   -.0749371
         21  |  -.1688563   .0107918   -15.65   0.000    -.1900079   -.1477047
         22  |  -.2156244   .0105416   -20.45   0.000    -.2362856   -.1949632
         23  |  -.2662625   .0103925   -25.62   0.000    -.2866314   -.2458936
         24  |  -.3091868   .0103018   -30.01   0.000    -.3293779   -.2889957
         25  |  -.3378899   .0102466   -32.98   0.000     -.357973   -.3178069
         26  |  -.3657323   .0102146   -35.80   0.000    -.3857526   -.3457121
         27  |  -.3906866   .0101941   -38.32   0.000    -.4106667   -.3707065
         28  |  -.4119395   .0101801   -40.47   0.000    -.4318921   -.3919868
             |
       _cons |   .4691832   .0101212    46.36   0.000      .449346    .4890205
------------------------------------------------------------------------------

.   estimates store E

. reg marrinyr movedst scplus i.age if sex==1 [pw=perwt], robust
(sum of wgt is 351,060)

Linear regression                               Number of obs     =    242,219
                                                F(12, 242206)     =     656.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0487
                                                Root MSE          =     .39418

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |    .056685    .003895    14.55   0.000     .0490509    .0643192
      scplus |   .0847031   .0018709    45.27   0.000     .0810362      .08837
             |
         age |
         19  |   .0935135   .0232005     4.03   0.000     .0480411    .1389859
         20  |   .0208091   .0207401     1.00   0.316    -.0198409    .0614591
         21  |  -.0250933   .0198614    -1.26   0.206    -.0640211    .0138345
         22  |  -.0819665   .0193578    -4.23   0.000    -.1199073   -.0440258
         23  |  -.1325323   .0190717    -6.95   0.000    -.1699122   -.0951523
         24  |  -.1838241   .0189023    -9.72   0.000    -.2208721   -.1467761
         25  |  -.2208848   .0188063   -11.75   0.000    -.2577445    -.184025
         26  |  -.2520474   .0187504   -13.44   0.000    -.2887976   -.2152971
         27  |  -.2783721   .0187177   -14.87   0.000    -.3150583    -.241686
         28  |  -.3004811   .0186944   -16.07   0.000    -.3371216   -.2638405
             |
       _cons |   .3801138   .0186109    20.42   0.000     .3436368    .4165907
------------------------------------------------------------------------------

.   estimates store Emen

. reg marrinyr movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 213,688)

Linear regression                               Number of obs     =    143,220
                                                F(12, 143207)     =     419.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0577
                                                Root MSE          =     .38663

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0438721   .0051349     8.54   0.000     .0338079    .0539364
      scplus |   .0380064    .002413    15.75   0.000      .033277    .0427358
             |
         age |
         19  |    .125731   .0309387     4.06   0.000     .0650917    .1863703
         20  |   .0613871   .0283609     2.16   0.030     .0058002     .116974
         21  |  -.0002479   .0274679    -0.01   0.993    -.0540845    .0535887
         22  |  -.0682471    .027009    -2.53   0.012    -.1211843   -.0153099
         23  |  -.1373384   .0267283    -5.14   0.000    -.1897254   -.0849514
         24  |  -.1821148   .0265664    -6.86   0.000    -.2341845    -.130045
         25  |  -.2286918   .0264575    -8.64   0.000    -.2805481   -.1768356
         26  |  -.2572454   .0264037    -9.74   0.000    -.3089961   -.2054948
         27  |  -.2798003   .0263712   -10.61   0.000    -.3314873   -.2281133
         28  |  -.3013669   .0263414   -11.44   0.000    -.3529955   -.2497384
             |
       _cons |   .3922578   .0262616    14.94   0.000     .3407855    .4437301
------------------------------------------------------------------------------

.   estimates store Eed

. reg marrinyr movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robus
> t
(sum of wgt is 166,317)

Linear regression                               Number of obs     =    114,357
                                                F(12, 114344)     =     362.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0626
                                                Root MSE          =     .38522

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0433858   .0057886     7.50   0.000     .0320403    .0547312
      scplus |   .0384509   .0026899    14.29   0.000     .0331787    .0437232
             |
         age |
         19  |   .1185006   .0368331     3.22   0.001     .0463082     .190693
         20  |   .0373684   .0336573     1.11   0.267    -.0285995    .1033362
         21  |  -.0219754   .0327245    -0.67   0.502    -.0861149    .0421642
         22  |  -.0960546   .0322157    -2.98   0.003    -.1591968   -.0329124
         23  |  -.1658679   .0319197    -5.20   0.000    -.2284301   -.1033057
         24  |  -.2177474   .0317462    -6.86   0.000    -.2799695   -.1555254
         25  |  -.2659667   .0316285    -8.41   0.000    -.3279581   -.2039754
         26  |  -.2949721   .0315713    -9.34   0.000    -.3568513   -.2330928
         27  |   -.315761   .0315417   -10.01   0.000    -.3775823   -.2539397
         28  |  -.3387867   .0315079   -10.75   0.000    -.4005417   -.2770317
             |
       _cons |   .4263619   .0314337    13.56   0.000     .3647524    .4879714
------------------------------------------------------------------------------

.   est sto Ewhite

. reg marrinyr movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robus
> t
(sum of wgt is 19,783)

Linear regression                               Number of obs     =     10,988
                                                F(12, 10975)      =      23.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0412
                                                Root MSE          =     .39424

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0549912   .0178629     3.08   0.002     .0199768    .0900056
      scplus |   .0184948   .0090854     2.04   0.042     .0006858    .0363039
             |
         age |
         19  |   .3000505   .0702627     4.27   0.000     .1623229    .4377781
         20  |    .293346    .061368     4.78   0.000     .1730536    .4136383
         21  |   .2238887   .0561836     3.98   0.000     .1137587    .3340187
         22  |    .201331   .0539171     3.73   0.000     .0956438    .3070182
         23  |   .0952165   .0516179     1.84   0.065    -.0059639    .1963969
         24  |   .0911021   .0507489     1.80   0.073    -.0083748     .190579
         25  |   .0681768   .0500819     1.36   0.173    -.0299928    .1663464
         26  |   .0357225   .0497171     0.72   0.472     -.061732    .1331771
         27  |  -.0122103     .04928    -0.25   0.804     -.108808    .0843873
         28  |  -.0181122   .0491164    -0.37   0.712    -.1143893    .0781649
             |
       _cons |   .1352788   .0485037     2.79   0.005     .0402028    .2303547
------------------------------------------------------------------------------

.   est sto Eblack

. reg marrinyr movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1
>  [pw=perwt], robust
(sum of wgt is 47,753)

Linear regression                               Number of obs     =     29,756
                                                F(12, 29743)      =      74.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0522
                                                Root MSE          =     .36743

------------------------------------------------------------------------------
             |               Robust
    marrinyr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0327576   .0113059     2.90   0.004     .0105975    .0549177
      scplus |   .0385143   .0049635     7.76   0.000     .0287857     .048243
             |
         age |
         19  |    .033822   .0581098     0.58   0.561    -.0800758    .1477197
         20  |    -.06445   .0542363    -1.19   0.235    -.1707556    .0418555
         21  |  -.1449663   .0522441    -2.77   0.006    -.2473671   -.0425656
         22  |  -.2314665   .0512958    -4.51   0.000    -.3320084   -.1309246
         23  |  -.2622878   .0508304    -5.16   0.000    -.3619176   -.1626579
         24  |  -.2916327   .0504564    -5.78   0.000    -.3905295   -.1927358
         25  |  -.3400815   .0502149    -6.77   0.000    -.4385049   -.2416582
         26  |  -.3635559    .050088    -7.26   0.000    -.4617306   -.2653812
         27  |  -.3727725   .0500704    -7.44   0.000    -.4709127   -.2746323
         28  |   -.382323   .0500174    -7.64   0.000    -.4803592   -.2842868
             |
       _cons |   .4730522   .0497955     9.50   0.000     .3754507    .5706536
------------------------------------------------------------------------------

.   est sto Ehisp

. 
. reg married movedst scplus i.age [pw=perwt], robust
(sum of wgt is 4,613,465)

Linear regression                               Number of obs     =  3,060,130
                                                F(12, 3060117)    =   30132.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1095
                                                Root MSE          =     .35401

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0569947   .0012129    46.99   0.000     .0546176    .0593719
      scplus |  -.0143018   .0005081   -28.15   0.000    -.0152977    -.013306
             |
         age |
         19  |   .0169586   .0004569    37.11   0.000      .016063    .0178542
         20  |   .0369618   .0005499    67.21   0.000      .035884    .0380397
         21  |   .0635828   .0006548    97.10   0.000     .0622994    .0648661
         22  |    .093848   .0007413   126.59   0.000      .092395    .0953009
         23  |   .1312988   .0008234   159.45   0.000     .1296849    .1329126
         24  |   .1752978   .0009034   194.05   0.000     .1735272    .1770684
         25  |   .2233793   .0009516   234.75   0.000     .2215142    .2252443
         26  |   .2761165    .001015   272.04   0.000     .2741272    .2781058
         27  |   .3296946     .00106   311.03   0.000      .327617    .3317722
         28  |   .3797624   .0010884   348.91   0.000     .3776291    .3818957
             |
       _cons |   .0120135   .0002478    48.47   0.000     .0115277    .0124992
------------------------------------------------------------------------------

.   estimates store F

. reg married movedst scplus i.age if sex==1 [pw=perwt], robust
(sum of wgt is 2,313,096)

Linear regression                               Number of obs     =  1,516,686
                                                F(12, 1516673)    =   12986.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1054
                                                Root MSE          =     .32189

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0471203   .0016118    29.24   0.000     .0439613    .0502794
      scplus |   -.012173   .0006481   -18.78   0.000    -.0134433   -.0109027
             |
         age |
         19  |    .009006   .0004527    19.89   0.000     .0081187    .0098933
         20  |     .02332    .000597    39.06   0.000     .0221498    .0244902
         21  |   .0421877   .0007453    56.61   0.000      .040727    .0436484
         22  |    .066615   .0008805    75.66   0.000     .0648894    .0683407
         23  |   .0990363    .001018    97.29   0.000     .0970411    .1010315
         24  |   .1377186   .0011472   120.05   0.000     .1354702     .139967
         25  |   .1818785   .0012367   147.06   0.000     .1794546    .1843025
         26  |   .2304634   .0013411   171.85   0.000      .227835    .2330919
         27  |   .2845458   .0014342   198.40   0.000     .2817348    .2873568
         28  |   .3360819   .0014937   225.00   0.000     .3331542    .3390096
             |
       _cons |   .0064259   .0002499    25.72   0.000     .0059362    .0069157
------------------------------------------------------------------------------

.   estimates store Fmen

. reg married movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 [pw=perwt], robust
(sum of wgt is 1,498,213)

Linear regression                               Number of obs     =    965,495
                                                F(12, 965482)     =    7203.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1088
                                                Root MSE          =     .31017

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0801103    .002338    34.26   0.000     .0755279    .0846927
      scplus |   -.004371   .0007626    -5.73   0.000    -.0058657   -.0028763
             |
         age |
         19  |   .0053716   .0005386     9.97   0.000     .0043161    .0064272
         20  |   .0171801   .0006634    25.90   0.000     .0158799    .0184804
         21  |   .0345537    .000813    42.50   0.000     .0329602    .0361472
         22  |   .0615556   .0010082    61.05   0.000     .0595795    .0635316
         23  |   .1007082   .0012706    79.26   0.000     .0982178    .1031986
         24  |   .1442394   .0014963    96.40   0.000     .1413068    .1471721
         25  |   .1874996    .001642   114.19   0.000     .1842814    .1907178
         26  |   .2344165   .0018125   129.33   0.000      .230864    .2379691
         27  |   .2811834   .0019493   144.25   0.000     .2773628     .285004
         28  |   .3250308   .0020434   159.06   0.000     .3210257    .3290359
             |
       _cons |   .0052837   .0004234    12.48   0.000     .0044538    .0061136
------------------------------------------------------------------------------

.   estimates store Fed

. reg married movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & race==1 [pw=perwt], robust
(sum of wgt is 1,056,545)

Linear regression                               Number of obs     =    703,434
                                                F(12, 703421)     =    5995.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1201
                                                Root MSE          =     .32165

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0783615   .0027684    28.31   0.000     .0729356    .0837874
      scplus |  -.0043494    .000932    -4.67   0.000    -.0061761   -.0025227
             |
         age |
         19  |   .0054066   .0006709     8.06   0.000     .0040916    .0067215
         20  |   .0183711   .0008161    22.51   0.000     .0167715    .0199707
         21  |   .0372363   .0009988    37.28   0.000     .0352788    .0391938
         22  |   .0675835   .0012388    54.56   0.000     .0651555    .0700115
         23  |   .1148867   .0015944    72.06   0.000     .1117617    .1180118
         24  |   .1604499   .0018276    87.79   0.000     .1568678     .164032
         25  |   .2070969    .002004   103.34   0.000     .2031691    .2110246
         26  |   .2594185    .002193   118.29   0.000     .2551203    .2637168
         27  |   .3076545   .0023416   131.39   0.000      .303065    .3122439
         28  |    .353817   .0024304   145.58   0.000     .3490534    .3585805
             |
       _cons |   .0057447   .0005191    11.07   0.000     .0047273    .0067622
------------------------------------------------------------------------------

.   est sto Fwhite

. reg married movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & race==2 [pw=perwt], robust
(sum of wgt is 213,420)

Linear regression                               Number of obs     =    115,235
                                                F(12, 115222)     =     454.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0669
                                                Root MSE          =      .2577

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0910557   .0069895    13.03   0.000     .0773564    .1047551
      scplus |   .0088805    .001801     4.93   0.000     .0053506    .0124105
             |
         age |
         19  |     .00126   .0012826     0.98   0.326    -.0012538    .0037737
         20  |   .0081302   .0016454     4.94   0.000     .0049052    .0113552
         21  |   .0195506   .0020152     9.70   0.000     .0156008    .0235004
         22  |   .0334531    .002336    14.32   0.000     .0288745    .0380317
         23  |   .0492438   .0027466    17.93   0.000     .0438604    .0546271
         24  |   .0799299   .0034724    23.02   0.000      .073124    .0867357
         25  |   .1100778    .003858    28.53   0.000     .1025162    .1176395
         26  |    .133641   .0043421    30.78   0.000     .1251304    .1421515
         27  |    .173652   .0047866    36.28   0.000     .1642703    .1830337
         28  |   .2037828   .0051314    39.71   0.000     .1937253    .2138404
             |
       _cons |  -9.71e-06    .001075    -0.01   0.993    -.0021168    .0020973
------------------------------------------------------------------------------

.   est sto Fblack

. reg married movedst scplus i.age if sex==1 & inlist(educd,63,65,71,81)==1 & inlist(hispan,1,2,3,4)==1 
> [pw=perwt], robust
(sum of wgt is 319,988)

Linear regression                               Number of obs     =    196,302
                                                F(12, 196289)     =    1443.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1080
                                                Root MSE          =     .31891

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     movedst |   .0906962   .0061457    14.76   0.000     .0786508    .1027416
      scplus |  -.0254205   .0017045   -14.91   0.000    -.0287613   -.0220798
             |
         age |
         19  |   .0118542   .0013757     8.62   0.000     .0091578    .0145506
         20  |   .0258758   .0016313    15.86   0.000     .0226785    .0290731
         21  |   .0456236   .0019468    23.44   0.000     .0418079    .0494393
         22  |   .0745773   .0024484    30.46   0.000     .0697785    .0793761
         23  |   .1107115   .0029114    38.03   0.000     .1050053    .1164176
         24  |   .1516032   .0033278    45.56   0.000     .1450808    .1581256
         25  |    .199054   .0037006    53.79   0.000     .1918009     .206307
         26  |    .245416   .0040819    60.12   0.000     .2374156    .2534164
         27  |   .2889784   .0043923    65.79   0.000     .2803696    .2975872
         28  |   .3387171   .0046513    72.82   0.000     .3296007    .3478334
             |
       _cons |   .0149123   .0010781    13.83   0.000     .0127994    .0170253
------------------------------------------------------------------------------

.   est sto Fhisp  

. 
. estout A Amen Aed, keep(moved) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        A            Amen             Aed   
                     b/se            b/se            b/se   
------------------------------------------------------------
moved               0.135***        0.142***        0.138***
                  (0.001)         (0.002)         (0.003)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.026           0.028           0.027   
------------------------------------------------------------

. estout Awhite Ablack Ahisp, keep(moved) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Awhite          Ablack           Ahisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
moved               0.148***        0.119***        0.114***
                  (0.003)         (0.010)         (0.006)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.031           0.020           0.020   
------------------------------------------------------------

. estout B Bmen Bed, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        B            Bmen             Bed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.105***        0.085***        0.079***
                  (0.003)         (0.004)         (0.005)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.005           0.003           0.003   
------------------------------------------------------------

. estout Bwhite Bblack Bhisp, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Bwhite          Bblack           Bhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.083***        0.078***        0.063***
                  (0.006)         (0.019)         (0.012)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.003           0.003           0.001   
------------------------------------------------------------

. estout C Cmen Ced, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        C            Cmen             Ced   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.004***        0.007***        0.015***
                  (0.001)         (0.002)         (0.003)   
------------------------------------------------------------
N              628408.000      242207.000      143213.000   
r2                  0.000           0.000           0.000   
------------------------------------------------------------

. estout Cwhite Cblack Chisp, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Cwhite          Cblack           Chisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.019***        0.011           0.005   
                  (0.003)         (0.009)         (0.005)   
------------------------------------------------------------
N              114351.000       10988.000       29755.000   
r2                  0.001           0.000           0.000   
------------------------------------------------------------

. estout D Dmen Ded, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        D            Dmen             Ded   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.073***        0.063***        0.086***
                  (0.001)         (0.002)         (0.002)   
------------------------------------------------------------
N             3060130.000     1516686.000      965495.000   
r2                  0.002           0.002           0.003   
------------------------------------------------------------

. estout Dwhite Dblack Dhisp, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Dwhite          Dblack           Dhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.085***        0.098***        0.102***
                  (0.003)         (0.007)         (0.006)   
------------------------------------------------------------
N              703434.000      115235.000      196302.000   
r2                  0.002           0.005           0.003   
------------------------------------------------------------

. estout E Emen Eed, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        E            Emen             Eed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.080***        0.057***        0.044***
                  (0.002)         (0.004)         (0.005)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.055           0.049           0.058   
------------------------------------------------------------

. estout Ewhite Eblack Ehisp, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Ewhite          Eblack           Ehisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.043***        0.055**         0.033** 
                  (0.006)         (0.018)         (0.011)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.063           0.041           0.052   
------------------------------------------------------------

. estout F Fmen Fed, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        F            Fmen             Fed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.057***        0.047***        0.080***
                  (0.001)         (0.002)         (0.002)   
------------------------------------------------------------
N             3060130.000     1516686.000      965495.000   
r2                  0.109           0.105           0.109   
------------------------------------------------------------

. estout Fwhite Fblack Fhisp, keep(movedst) cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Fwhite          Fblack           Fhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.078***        0.091***        0.091***
                  (0.003)         (0.007)         (0.006)   
------------------------------------------------------------
N              703434.000      115235.000      196302.000   
r2                  0.120           0.067           0.108   
------------------------------------------------------------

. 
. estout A Amen Aed, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        A            Amen             Aed   
                     b/se            b/se            b/se   
------------------------------------------------------------
moved               0.135***        0.142***        0.138***
                  (0.001)         (0.002)         (0.003)   
_cons               0.145***        0.157***        0.151***
                  (0.001)         (0.001)         (0.001)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.026           0.028           0.027   
------------------------------------------------------------

. estout Awhite Ablack Ahisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Awhite          Ablack           Ahisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
moved               0.148***        0.119***        0.114***
                  (0.003)         (0.010)         (0.006)   
_cons               0.148***        0.160***        0.136***
                  (0.001)         (0.005)         (0.003)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.031           0.020           0.020   
------------------------------------------------------------

. estout B Bmen Bed, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        B            Bmen             Bed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.105***        0.085***        0.079***
                  (0.003)         (0.004)         (0.005)   
_cons               0.182***        0.199***        0.192***
                  (0.001)         (0.001)         (0.001)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.005           0.003           0.003   
------------------------------------------------------------

. estout Bwhite Bblack Bhisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Bwhite          Bblack           Bhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.083***        0.078***        0.063***
                  (0.006)         (0.019)         (0.012)   
_cons               0.191***        0.197***        0.168***
                  (0.001)         (0.005)         (0.003)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.003           0.003           0.001   
------------------------------------------------------------

. estout C Cmen Ced, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        C            Cmen             Ced   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.004***        0.007***        0.015***
                  (0.001)         (0.002)         (0.003)   
_cons               0.028***        0.027***        0.032***
                  (0.000)         (0.000)         (0.001)   
------------------------------------------------------------
N              628408.000      242207.000      143213.000   
r2                  0.000           0.000           0.000   
------------------------------------------------------------

. estout Cwhite Cblack Chisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Cwhite          Cblack           Chisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.019***        0.011           0.005   
                  (0.003)         (0.009)         (0.005)   
_cons               0.033***        0.034***        0.024***
                  (0.001)         (0.002)         (0.001)   
------------------------------------------------------------
N              114351.000       10988.000       29755.000   
r2                  0.001           0.000           0.000   
------------------------------------------------------------

. estout D Dmen Ded, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        D            Dmen             Ded   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.073***        0.063***        0.086***
                  (0.001)         (0.002)         (0.002)   
_cons               0.166***        0.130***        0.120***
                  (0.000)         (0.000)         (0.000)   
------------------------------------------------------------
N             3060130.000     1516686.000      965495.000   
r2                  0.002           0.002           0.003   
------------------------------------------------------------

. estout Dwhite Dblack Dhisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Dwhite          Dblack           Dhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.085***        0.098***        0.102***
                  (0.003)         (0.007)         (0.006)   
_cons               0.132***        0.074***        0.128***
                  (0.000)         (0.001)         (0.001)   
------------------------------------------------------------
N              703434.000      115235.000      196302.000   
r2                  0.002           0.005           0.003   
------------------------------------------------------------

. estout E Emen Eed, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        E            Emen             Eed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.080***        0.057***        0.044***
                  (0.002)         (0.004)         (0.005)   
scplus              0.084***        0.085***        0.038***
                  (0.001)         (0.002)         (0.002)   
18.age              0.000           0.000           0.000   
                      (.)             (.)             (.)   
19.age              0.006           0.094***        0.126***
                  (0.012)         (0.023)         (0.031)   
20.age             -0.097***        0.021           0.061*  
                  (0.011)         (0.021)         (0.028)   
21.age             -0.169***       -0.025          -0.000   
                  (0.011)         (0.020)         (0.027)   
22.age             -0.216***       -0.082***       -0.068*  
                  (0.011)         (0.019)         (0.027)   
23.age             -0.266***       -0.133***       -0.137***
                  (0.010)         (0.019)         (0.027)   
24.age             -0.309***       -0.184***       -0.182***
                  (0.010)         (0.019)         (0.027)   
25.age             -0.338***       -0.221***       -0.229***
                  (0.010)         (0.019)         (0.026)   
26.age             -0.366***       -0.252***       -0.257***
                  (0.010)         (0.019)         (0.026)   
27.age             -0.391***       -0.278***       -0.280***
                  (0.010)         (0.019)         (0.026)   
28.age             -0.412***       -0.300***       -0.301***
                  (0.010)         (0.019)         (0.026)   
_cons               0.469***        0.380***        0.392***
                  (0.010)         (0.019)         (0.026)   
------------------------------------------------------------
N              628444.000      242219.000      143220.000   
r2                  0.055           0.049           0.058   
------------------------------------------------------------

. estout Ewhite Eblack Ehisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Ewhite          Eblack           Ehisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.043***        0.055**         0.033** 
                  (0.006)         (0.018)         (0.011)   
scplus              0.038***        0.018*          0.039***
                  (0.003)         (0.009)         (0.005)   
18.age              0.000           0.000           0.000   
                      (.)             (.)             (.)   
19.age              0.119**         0.300***        0.034   
                  (0.037)         (0.070)         (0.058)   
20.age              0.037           0.293***       -0.064   
                  (0.034)         (0.061)         (0.054)   
21.age             -0.022           0.224***       -0.145** 
                  (0.033)         (0.056)         (0.052)   
22.age             -0.096**         0.201***       -0.231***
                  (0.032)         (0.054)         (0.051)   
23.age             -0.166***        0.095          -0.262***
                  (0.032)         (0.052)         (0.051)   
24.age             -0.218***        0.091          -0.292***
                  (0.032)         (0.051)         (0.050)   
25.age             -0.266***        0.068          -0.340***
                  (0.032)         (0.050)         (0.050)   
26.age             -0.295***        0.036          -0.364***
                  (0.032)         (0.050)         (0.050)   
27.age             -0.316***       -0.012          -0.373***
                  (0.032)         (0.049)         (0.050)   
28.age             -0.339***       -0.018          -0.382***
                  (0.032)         (0.049)         (0.050)   
_cons               0.426***        0.135**         0.473***
                  (0.031)         (0.049)         (0.050)   
------------------------------------------------------------
N              114357.000       10988.000       29756.000   
r2                  0.063           0.041           0.052   
------------------------------------------------------------

. estout F Fmen Fed, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                        F            Fmen             Fed   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.057***        0.047***        0.080***
                  (0.001)         (0.002)         (0.002)   
scplus             -0.014***       -0.012***       -0.004***
                  (0.001)         (0.001)         (0.001)   
18.age              0.000           0.000           0.000   
                      (.)             (.)             (.)   
19.age              0.017***        0.009***        0.005***
                  (0.000)         (0.000)         (0.001)   
20.age              0.037***        0.023***        0.017***
                  (0.001)         (0.001)         (0.001)   
21.age              0.064***        0.042***        0.035***
                  (0.001)         (0.001)         (0.001)   
22.age              0.094***        0.067***        0.062***
                  (0.001)         (0.001)         (0.001)   
23.age              0.131***        0.099***        0.101***
                  (0.001)         (0.001)         (0.001)   
24.age              0.175***        0.138***        0.144***
                  (0.001)         (0.001)         (0.001)   
25.age              0.223***        0.182***        0.187***
                  (0.001)         (0.001)         (0.002)   
26.age              0.276***        0.230***        0.234***
                  (0.001)         (0.001)         (0.002)   
27.age              0.330***        0.285***        0.281***
                  (0.001)         (0.001)         (0.002)   
28.age              0.380***        0.336***        0.325***
                  (0.001)         (0.001)         (0.002)   
_cons               0.012***        0.006***        0.005***
                  (0.000)         (0.000)         (0.000)   
------------------------------------------------------------
N             3060130.000     1516686.000      965495.000   
r2                  0.109           0.105           0.109   
------------------------------------------------------------

. estout Fwhite Fblack Fhisp, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)

------------------------------------------------------------
                   Fwhite          Fblack           Fhisp   
                     b/se            b/se            b/se   
------------------------------------------------------------
movedst             0.078***        0.091***        0.091***
                  (0.003)         (0.007)         (0.006)   
scplus             -0.004***        0.009***       -0.025***
                  (0.001)         (0.002)         (0.002)   
18.age              0.000           0.000           0.000   
                      (.)             (.)             (.)   
19.age              0.005***        0.001           0.012***
                  (0.001)         (0.001)         (0.001)   
20.age              0.018***        0.008***        0.026***
                  (0.001)         (0.002)         (0.002)   
21.age              0.037***        0.020***        0.046***
                  (0.001)         (0.002)         (0.002)   
22.age              0.068***        0.033***        0.075***
                  (0.001)         (0.002)         (0.002)   
23.age              0.115***        0.049***        0.111***
                  (0.002)         (0.003)         (0.003)   
24.age              0.160***        0.080***        0.152***
                  (0.002)         (0.003)         (0.003)   
25.age              0.207***        0.110***        0.199***
                  (0.002)         (0.004)         (0.004)   
26.age              0.259***        0.134***        0.245***
                  (0.002)         (0.004)         (0.004)   
27.age              0.308***        0.174***        0.289***
                  (0.002)         (0.005)         (0.004)   
28.age              0.354***        0.204***        0.339***
                  (0.002)         (0.005)         (0.005)   
_cons               0.006***       -0.000           0.015***
                  (0.001)         (0.001)         (0.001)   
------------------------------------------------------------
N              703434.000      115235.000      196302.000   
r2                  0.120           0.067           0.108   
------------------------------------------------------------

. 
. 
. /*
> estout B*, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)
> estout C*, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)
> estout D*, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)
> estout E*, cells(b(star fmt(3)) se(par fmt(3))) stats(N r2)
> */
. 
end of do-file

. exit, clear
